# AssemblyMemberDifferentCategory Properties

---
The AssemblyMemberDifferentCategory type exposes the following members.
| Name| Description
---|---|---
| CategoryId1|  Category id of the first assembly member
| CategoryId2|  Category id of the second assembly member
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from AssemblyMemberDifference)
Top
#### Reference
AssemblyMemberDifferentCategory Class
Autodesk.Revit.DB Namespace